# PropertySetName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertySetName Property
ParameterTypeId Class See Also
---
"Property Set Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertySetName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertySetName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertySetName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace